Revit 2024 API
ExportLineweightInfo Properties
The ExportLineweightInfo type exposes the following members.
Properties
Name | Description
DestinationLineweightName
 The destination lineweight name (the name of the line weight in the exported format)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExportLineweightInfo Class
Autodesk.Revit.DB Namespace